import { 环形缓冲实例 } from './全局'
import type { 日志上下文 } from './类型'

export const 日志器实例 = {
  debug(消息: string, 上下文?: 日志上下文) {
    环形缓冲实例.写入('debug', 1, 消息, 上下文)
  },
  信息(消息: string, 上下文?: 日志上下文) {
    环形缓冲实例.写入('info', 1, 消息, 上下文)
  },
  warn(消息: string, 上下文?: 日志上下文) {
    环形缓冲实例.写入('warn', 1, 消息, 上下文)
  },
  错误(消息: string, 上下文?: 日志上下文) {
    环形缓冲实例.写入('error', 1, 消息, 上下文)
  },
  致命(消息: string, 上下文?: 日志上下文) {
    环形缓冲实例.写入('fatal', 1, 消息, 上下文)
  },
  获取会话编号(): string {
    return 'ringbuf-01'
  },
  注册收集器() {},
}
